############################################################################################
#set units and define corner
set_cmd_units -time ns -capacitance pF -current mA -voltage V -resistance kOhm -distance um
define_corners typical
############################################################################################

############################################################################################
#Read LEF files
read_lef ../../lefs/sky130.tlef ; # Techlef

read_lef ../../lefs/sky130_fd_sc_hd.lef ; # load all cell lefs
############################################################################################

############################################################################################
# Read LIB file
read_liberty -corner typical ../../lib/sky130_fd_sc_hd__tt_025C_1v80.lib
############################################################################################

############################################################################################
# Read the netlist
read_verilog ../syn/segment_seconds_netlist.v
link_design seven_segment_seconds
############################################################################################

############################################################################################
# Read SDC file
read_sdc ../../scr/sdc/const.sdc
############################################################################################
